Repository: Kun686/iTerm2-CN
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# ui.swift.appkit.commandurlhandler.in_0.6b74890f
source: in %1$@
zh_hans: 于 %1$@ 中

source: ? It will run silently in the background.
zh_hans: ？ 它将在后台静默运行。

# ui.swift.appkit.commandurlhandler.ok.565339bc
source: OK
zh_hans: 好

# ui.swift.appkit.commandurlhandler.on_0.e1950d94
source: on %1$@
zh_hans: 在 %1$@ 上

# ui.swift.appkit.commandurlhandler.open_in_tab_offered.c81f0947
source: Open in tab offered
zh_hans: 提供在标签页中打开的选项

# ui.swift.appkit.commandurlhandler.run_as_0.8d91a556
source: Run as %1$@
zh_hans: 以 %1$@ 身份运行

# ui.swift.appkit.commandurlhandler.run_command.81c57ee5
source: Run Command?
zh_hans: 运行命令？

# ui.swift.appkit.commandurlhandler.run_command.87e30f34
source: Run command
zh_hans: 运行命令

# ui.swift.appkit.commandurlhandler.run_command_from_url.b7aa75af
source: Run Command from URL
zh_hans: 运行 URL 中的命令

# ui.swift.appkit.commandurlhandler.run_in_current_session.3eae81b1
source: Run in Current Session
zh_hans: 在当前会话中运行

# ui.swift.appkit.commandurlhandler.run_in_current_session_offered.b88c4968
source: Run in current session offered
zh_hans: 提供在当前会话中运行的选项

# ui.swift.appkit.commandurlhandler.run_in_directory_0.7f97b5d4
source: Run in directory %1$@
zh_hans: 在目录 %1$@ 中运行

# ui.swift.appkit.commandurlhandler.run_in_new_tab.7fe3c70c
source: Run in New Tab
zh_hans: 在新标签页中运行

# ui.swift.appkit.commandurlhandler.run_in_new_window.ebd1dc61
source: Run in New Window
zh_hans: 在新窗口中运行

# ui.swift.appkit.commandurlhandler.run_on_0_via_ssh.da549650
source: Run on %1$@ via ssh
zh_hans: 通过 SSH 在 %1$@ 上运行

# ui.swift.appkit.commandurlhandler.username.3806d61c
source: Username:
zh_hans: 用户名：

# ui.swift.appkit.commandurlhandler.username.e3b89e9d
source: Username
zh_hans: 用户名

source: A **Coprocess** is a program that automates interactions in the terminal. Input to the terminal is redirected to stdin of the coprocess, and its output is sent back to the terminal as though the coprocess were typing.
zh_hans: **协进程**是自动执行终端交互的程序。终端输入会重定向到协进程的标准输入，而协进程的输出会像由协进程键入一样发送回终端。

source: A **Mark** appears as a blue triangle in the left margin. You can easily navigate among marks using **Jump to Mark**, **Next Mark**, and **Previous Mark**. If Shell Integration is enabled, a Mark is automatically added at each shell prompt.
zh_hans: **标记**在左侧边距中显示为蓝色三角形。您可以使用**跳转到标记**、**下一个标记**和**上一个标记**在标记间轻松导航。启用 Shell 集成后，每个 Shell 提示符处都会自动添加标记。

source: A **Named Mark** appears as a blue triangle in the left margin. In addition to being easy to navigate with **Next Mark** and **Previous Mark**, you can also find Named Marks in the Toolbelt’s **Named Marks** tool.
zh_hans: **命名标记**在左侧边距中显示为蓝色三角形。除了可使用**下一个标记**和**上一个标记**轻松导航外，您还可以在工具侧栏的**命名标记**工具中找到它们。

source: A **Named Mark** appears as a blue triangle in the left margin. In addition to being easy to navigate with **Next Mark** and **Previous Mark**, you can also find Named Marks in this Toolbelt tool.
zh_hans: **命名标记**在左侧边距中显示为蓝色三角形。除了可使用**下一个标记**和**上一个标记**轻松导航外，您还可以在此工具侧栏工具中找到命名标记。

source: A **pinned** Hotkey Window does not close automatically when it loses keyboard focus.
zh_hans: **已固定**的热键窗口在失去键盘焦点时不会自动关闭。

source: Actions are saved instructions for iTerm2. For example, you could create an action that opens a new window and then creates a split pane.
zh_hans: 动作是为 iTerm2 保存的指令。例如，您可以创建一个先打开新窗口、再创建分割窗格的动作。

source: Adds or removes this session from the set of sessions in this window that have broadcast enabled. When you type in a session with broadcast enabled, the keystrokes are sent to all other sessions in the same window that have broadcast enabled.
zh_hans: 将此会话添加到此窗口中启用了广播的会话集合，或从中移除。在启用了广播的会话中键入内容时，按键会发送到同一窗口中所有其他启用了广播的会话。

source: **Advanced Paste** lets you edit text before pasting, remove control characters, convert tabs, base64-encode, and perform regular expression substitutions. It also lets you fine-tune how quickly pasted text is sent.
zh_hans: **高级粘贴**可让您在粘贴前编辑文本、移除控制字符、转换制表符、进行 base64 编码和正则表达式替换，还可精细调整粘贴文本的发送速度。

source: **AI Chats** opens a chat window where you can interact with AI. It can optionally view and control the terminal if you grant it permission.
zh_hans: **AI 聊天**会打开一个与 AI 交互的聊天窗口。如果您授予权限，AI 还可以选择性地查看和控制终端。

source: Annotations are inline markup. When closed, they appear as a yellow underline; when open, they look like yellow stickies where you can write memos about content in the terminal window.
zh_hans: 注释是行内标记。关闭时显示为黄色下划线；打开时则像黄色便签，您可以在其中记录有关终端窗口内容的备忘。

source: **Auto Composer** replaces your shell prompt with a macOS-native text field. It does syntax highlighting and command and filename completion. You can also enable AI-powered suggestions. Shell Integration is required.
zh_hans: **自动编写器**会用 macOS 原生文本字段替换 Shell 提示符。它支持语法高亮以及命令和文件名补全，也可启用 AI 建议。此功能需要 Shell 集成。

source: Buried sessions are hidden in the **Buried Sessions** menu below and do not appear in any window. These are particularly useful for the session where you initiate tmux integration by running `tmux -CC`.
zh_hans: 隐藏的会话会收纳在下方的**已隐藏的会话**菜单中，不会出现在任何窗口里。对于通过运行 `tmux -CC` 启动 tmux 集成的会话，这尤其有用。

source: **Captured Output** works in conjunction with a Trigger to detect interesting text in the terminal and make it easy to find. The Toolbelt tool shows a list of captured text. You can click to navigate to it or double-click to enter a programmable command. This is useful for finding errors in the output of a build command, for example. It requires Shell Integration.
zh_hans: **捕获的输出**与触发器配合使用，可检测终端中值得关注的文本并便于查找。工具侧栏会显示捕获文本的列表；您可以点按以跳转到对应位置，或双击输入可编程命令。例如，这有助于查找构建命令输出中的错误。此功能需要 Shell 集成。

source: Checks whether the GPU Renderer is currently being used in the active session. This is sometimes useful for debugging.
zh_hans: 检查活动会话当前是否正在使用 GPU 渲染器。这有时有助于调试。

source: **Codecierge** uses AI to help you achieve a goal. Tell it what you want to do, and it can watch your terminal to interpret output and suggest commands. Shell Integration is required.
zh_hans: **Codecierge** 使用 AI 帮助您实现目标。告诉它您想做什么，它便可观察终端、解读输出并建议命令。此功能需要 Shell 集成。

source: Debug logs are saved in memory while this setting is enabled and written to `/tmp/debuglog.txt` when you turn it off. Memory use is capped at about 200MB; if the log grows past that, the oldest entries are discarded so the most recent activity is always kept.
zh_hans: 启用此设置时，调试日志保存在内存中；关闭时会写入 `/tmp/debuglog.txt`。内存占用上限约为 200MB；如果日志超过此大小，最旧的条目会被丢弃，以始终保留最近的活动。

source: **Filter** allows you to hide any lines that do not match a search query, which can be a substring or regular expression. It updates live as new text arrives.
zh_hans: **过滤器**可隐藏所有不匹配搜索查询的行；查询可以是子字符串或正则表达式。新文本到达时，结果会实时更新。

source: **Fold** lets you collapse multiple lines into a single line to hide distracting text. You can always unfold it by clicking the arrow in the margin, selecting the text and using **Edit > Unfold in Selection**, or right-clicking and choosing **Unfold**.
zh_hans: **折叠**可将多行收起为一行，以隐藏干扰内容。您随时可以通过点按边距中的箭头、选择文本并使用**编辑 > 展开所选内容**，或右键点按并选择**展开**来恢复显示。

source: Hides everything except the lines of selected text to remove distractions.
zh_hans: 隐藏所选文本行以外的所有内容，减少干扰。

source: Highlights the location of the cursor and unhides it if it is currently hidden.
zh_hans: 突出显示光标位置；如果光标当前被隐藏，则将其显示出来。

source: If enabled, you’ll be prompted to confirm that you wish to send a newline when pasting a single line of text ending in a newline. Shell Integration is required.
zh_hans: 启用后，粘贴以换行符结尾的单行文本时，系统会提示您确认是否发送换行符。此功能需要 Shell 集成。

source: If Shell Integration is installed, **Command History** shows a searchable list of recently run commands on the current host.
zh_hans: 安装 Shell 集成后，**命令历史**会显示当前主机上最近运行命令的可搜索列表。

source: If you want to share Python API scripts, you can export them to an `.its` file. If you have a code signing certificate and private key in your Keychain, you can also sign the `.its` file.
zh_hans: 如果要共享 Python API 脚本，可以将其导出为 `.its` 文件。如果钥匙串中有代码签名证书和私钥，还可以为 `.its` 文件签名。

source: **Instant Replay** lets you review recent terminal history. It’s handy if something just disappeared from the screen and it isn’t in scrollback history.
zh_hans: **即时回放**可查看最近的终端历史。如果某些内容刚从屏幕上消失且不在回滚历史中，此功能会很有用。

source: iTerm2’s Python Runtime is a large binary package (hundreds of MBs) that enables the Python API by installing a pre-built Python environment that scripts can use.
zh_hans: iTerm2 的 Python 运行时是一个体积较大的二进制包（数百 MB），它通过安装供脚本使用的预构建 Python 环境来启用 Python API。

source: Locked windows resist being resized. This can be useful when macOS screws up your windows when connecting or disconnecting displays.
zh_hans: 锁定的窗口不易被调整大小。当连接或断开显示器时 macOS 打乱窗口尺寸，这会很有用。

source: **Notes** is a single, persistent notepad in your Toolbelt. It’s useful for keeping track of what you’re doing or composing messages.
zh_hans: **便笺**是工具侧栏中一个持久保存的记事本，可用于记录当前工作或撰写消息。

source: **Open Quickly** provides quick access to many common actions. You can use it to find a session by typing its name, directory, hostname, or recent command. You can also use it to switch profiles or create a new window by typing the name of a profile. Restore an arrangement by entering its name. Press `/` to get tips for quick commands.
zh_hans: **快速打开**可让您快速访问许多常用操作。输入会话名称、目录、主机名或最近使用的命令即可查找会话；输入配置文件名称还可切换配置文件或创建新窗口。输入窗口布局名称可恢复该布局。按 `/` 可查看快捷命令提示。

source: Opens a UI where you can add, update, or remove pip dependencies of a Python API script.
zh_hans: 打开一个界面，可在其中添加、更新或移除 Python API 脚本的 pip 依赖项。

source: **Paste History** shows text that you have copied and pasted in iTerm2. You can configure it to be saved long term.
zh_hans: **粘贴历史**显示您在 iTerm2 中拷贝和粘贴过的文本。您可以将其配置为长期保存。

source: Prompts you to select a profile and then splits the current session vertically, placing the new session in the right half.
zh_hans: 提示您选择配置文件，然后垂直分割当前会话，并在右半边放置新会话。

source: Prompts you to select a profile and then splits the current session horizontally, placing the new session in the bottom half.
zh_hans: 提示您选择配置文件，然后水平分割当前会话，并在下半边放置新会话。

source: Records the current width of the toolbelt for use in newly created windows.
zh_hans: 记录工具侧栏的当前宽度，供新建窗口使用。

source: **Render Natively** shows a nicely formatted, syntax-highlighted rendition of a document. For example, Markdown renders beautifully. It also allows for horizontal scrolling, making it a convenient way to view log files.
zh_hans: **原生渲染**会以精美格式和语法高亮显示文档。例如，Markdown 可获得良好的渲染效果。它还支持水平滚动，便于查看日志文件。

source: **Secure Keyboard Entry** prevents other programs from intercepting your keystrokes in the terminal. However, it also breaks some functionality: other programs cannot activate their windows while this is enabled. For example, the `open` command will still open an app, but it won’t be activated.
zh_hans: **安全键盘输入**可防止其他程序截获您在终端中的按键。不过，它也会影响部分功能：启用后，其他程序无法激活自己的窗口。例如，`open` 命令仍会打开应用，但不会将其激活。

source: **Shell Integration** consists of shell scripts that run when you log in. They inform iTerm2 of where your shell prompt is. This enables dozens of useful features such as command history, directory history, AI features, and more.
zh_hans: **Shell 集成**由登录时运行的 Shell 脚本组成，它们会告知 iTerm2 Shell 提示符的位置，从而启用命令历史、目录历史、AI 功能等数十项实用功能。

source: Shows a list of your profiles so you can create new sessions easily.
zh_hans: 显示配置文件列表，方便您创建新会话。

source: Shows your most used directories, sorted by a combination of frequency and recency of use. Requires Shell Integration.
zh_hans: 显示最常用的目录，并综合使用频率和最近使用时间排序。此功能需要 Shell 集成。

source: Snippets are pieces of text that you save to reuse later. They’re great for frequently used commands, hard-to-remember directories, and much more.
zh_hans: 代码片段是保存下来供以后重复使用的文本，适合存放常用命令、难记的目录等内容。

source: Splits the current session horizontally, placing a new session in the bottom half. The new session inherits the profile of the current session, including any changes made in `Session > Edit Session`.
zh_hans: 水平分割当前会话，并在下半边放置新会话。新会话会继承当前会话的配置文件，包括在 `会话 > 编辑会话` 中所做的任何更改。

source: Splits the current session vertically, placing a new session in the right half. The new session inherits the profile of the current session, including any changes made in `Session > Edit Session`.
zh_hans: 垂直分割当前会话，并在右半边放置新会话。新会话会继承当前会话的配置文件，包括在 `会话 > 编辑会话` 中所做的任何更改。

source: Stops the active coprocess. Input to the terminal is no longer redirected to the coprocess, and its output ceases.
zh_hans: 停止活动的协进程。终端输入将不再重定向到协进程，协进程的输出也会停止。

source: The Composer is a window within the terminal where you can edit text using macOS-native controls. It does syntax highlighting, command and filename completion—even over SSH (provided you use SSH Integration). If AI features are enabled, you can also get AI-powered suggestions. You can even have multiple cursors! When you're ready, you can send the whole buffer or just a line at a time to your shell.
zh_hans: 编写器是终端内的一个窗口，可使用 macOS 原生控件编辑文本。它支持语法高亮、命令和文件名补全，甚至可通过 SSH 使用（需要 SSH 集成）。启用 AI 功能后，还可获得 AI 建议，甚至可以使用多个光标。准备就绪后，您可以将整个缓冲区或逐行发送到 Shell。

source: The **Password Manager** helps you keep track of your passwords securely. By default, it stores them in the macOS Keychain, but it can also use 1Password or LastPass.
zh_hans: **密码管理器**可帮助您安全管理密码。默认情况下，密码存储在 macOS 钥匙串中，也可以使用 1Password 或 LastPass。

source: The Python REPL opens a window running a special Python interpreter that lets you experiment with iTerm2’s Python API. You can use `await` at the top level of the interpreter.
zh_hans: Python REPL 会打开一个运行专用 Python 解释器的窗口，供您试用 iTerm2 的 Python API。您可以在解释器顶层使用 `await`。

source: The **Session Status** tool shows the status of sessions across all tabs. Statuses can be set by the **Set Tab Status** trigger or by programs using a control sequence. Each entry shows the session name, a colored indicator dot, status text, and a keyboard shortcut to jump to that session.
zh_hans: **会话状态**工具显示所有标签页中各会话的状态。状态可由**设置标签页状态**触发器设置，也可由程序通过控制序列设置。每个条目都会显示会话名称、彩色指示点、状态文本，以及跳转到该会话的键盘快捷键。

source: The **tmux Dashboard** helps you switch between tmux sessions, show and hide windows, and administer other features of tmux without needing to use tmux’s commands.
zh_hans: **tmux 仪表盘**可帮助您切换 tmux 会话、显示和隐藏窗口，以及管理 tmux 的其他功能，无需使用 tmux 命令。

source: The **Toolbelt** provides a versatile, dockable sidebar that offers quick access to frequently used features and information. It supports multiple panels that can be displayed simultaneously, including clipboard history, recently opened directories, command history, a scratchpad for notes, and more.
zh_hans: **工具侧栏**是一种用途广泛、可停靠的侧边栏，可快速访问常用功能和信息。它支持同时显示多个面板，包括剪贴板历史、最近打开的目录、命令历史、记事便笺等。

source: This is effective only when **Warn Before Multi-Line Paste** is enabled. It also requires Shell Integration. When enabled, it suppresses confirmation when pasting text containing a newline if you are not at a shell prompt.
zh_hans: 此选项仅在启用**多行粘贴前警告**时生效，并且需要 Shell 集成。启用后，如果当前不在 Shell 提示符处，粘贴包含换行符的文本时将不再要求确认。

source: This is meant to be used at the shell prompt after executing a command. It requires Shell Integration. The output of the preceding (or selected) command is sent to AI, which annotates the output and opens a chat window for further discussion.
zh_hans: 此功能用于在执行命令后从 Shell 提示符调用，并且需要 Shell 集成。前一个（或所选）命令的输出会发送给 AI，由 AI 为输出添加注释并打开聊天窗口以便进一步讨论。

source: This mode is generally not recommended. **Disambiguate Escape** is a more modern approach.
zh_hans: 通常不建议使用此模式。**区分 Escape** 是更现代的方式。

source: **Triggers** are actions the terminal performs automatically when text matching a regular expression is received. For example, you can highlight text or display an alert.
zh_hans: **触发器**是终端在收到匹配正则表达式的文本时自动执行的动作。例如，可以突出显示文本或显示提醒。

source: Use **Import** to install scripts others have shared with you. These scripts have the `.its` extension.
zh_hans: 使用**导入**安装他人共享给您的脚本。这些脚本使用 `.its` 扩展名。

source: View errors and low-level communication between Python API scripts and iTerm2 here. The Inspector can be accessed from the Console. It allows you to browse variables in sessions, tabs, and windows.
zh_hans: 在此查看 Python API 脚本与 iTerm2 之间的错误和底层通信。 可以从控制台访问检查器，用它浏览会话、标签页和窗口中的变量。

source: When a window’s layout is locked, its tabs and panes can’t be added, closed, reordered, dragged, or moved to another window, so a stray click or drag can’t rearrange it. Resizing panes, opening new windows, and closing the window still work. This is an alternative to Lock Size; turning one on turns the other off.
zh_hans: 锁定窗口布局后，无法添加、关闭、重新排序或拖动其中的标签页和窗格，也无法将其移到其他窗口，因此误点按或拖动不会打乱布局。仍可调整窗格大小、打开新窗口以及关闭窗口。此功能与“锁定大小”互斥；启用其中一个会关闭另一个。

source: When enabled, anything you type in this tab is sent to all sessions in this tab.
zh_hans: 启用后，您在此标签页中键入的任何内容都会发送到此标签页中的所有会话。

source: When enabled, anything you type in this window is sent to all sessions in this window.
zh_hans: 启用后，您在此窗口中键入的任何内容都会发送到此窗口中的所有会话。

source: When enabled, control characters are displayed visually rather than being interpreted as usual.
zh_hans: 启用后，控制字符会以可见形式显示，而不会按通常方式解释。

source: When enabled, dividers rendered by programs like vim or emacs are detected, and text selection wraps around them.
zh_hans: 启用后，会检测 vim 或 emacs 等程序绘制的分隔线，并让文本选择绕过这些分隔线。

source: When enabled, prominent red lines are drawn in the background to indicate that text you type is being broadcast to other sessions.
zh_hans: 启用后，背景中会绘制醒目的红线，表示您键入的文本正广播到其他会话。

source: When enabled, the next time any session in this window changes its status (such as waiting, idle, or busy) an alert is shown and this setting turns itself back off. This is the same toggle as the bell button in the **Session Status** toolbelt tool, which must be open for this to be available.
zh_hans: 启用后，此窗口中的任一会话下次改变状态（例如等待、空闲或忙碌）时会显示提醒，然后此设置会自动关闭。它与工具侧栏**会话状态**工具中的铃铛按钮是同一个开关；必须打开该工具才能使用此设置。

source: When enabled, typing in this session is broadcast to other sessions in the same broadcast domain. Typing in other sessions sends input only to those sessions.
zh_hans: 启用后，在此会话中键入的内容会广播到同一广播域中的其他会话；在其他会话中键入时，输入只会发送到相应会话。

source: When selected at a shell prompt (provided Shell Integration is installed) or in the Composer, it sends the current command to the configured AI system along with a prompt for it to generate a command. If no input is provided, you’ll be asked to give instructions. The generated command goes into the Composer.
zh_hans: 在 Shell 提示符处（需要安装 Shell 集成）或编写器中选择此项时，当前命令会连同生成命令的提示一起发送给已配置的 AI 系统。如果没有输入内容，系统会要求您提供说明。生成的命令将进入编写器。

source: While Buffer Input is turned on, keyboard input is stored in a buffer. It will be sent when Buffer Input is turned off. You can also configure a trigger to change the Buffer Input setting.
zh_hans: 启用缓冲输入时，键盘输入会存储在缓冲区中；关闭缓冲输入后才会发送。您也可以配置触发器来更改缓冲输入设置。

source: **Window Arrangements** are a saved record of one or more windows, their tabs, and split panes, including how each pane is configured. They do not include content. They’re a quick way to create a working environment with multiple sessions in various configurations.
zh_hans: **窗口布局**是一个或多个窗口及其标签页和分割窗格的保存记录，其中包括每个窗格的配置，但不包含内容。借助窗口布局，可以快速创建由多个会话和不同配置组成的工作环境。

source: You’ll be prompted any time you paste text containing a newline. See also **Limit Multi-Line Paste Warning to Shell Prompt**.
zh_hans: 每当粘贴包含换行符的文本时都会提示您。另请参阅**仅在 Shell 提示符处显示多行粘贴警告**。

# ui.swift.appkit.itermmacos13requirementnotice.deprecation_notice.b5224f00
source: Deprecation Notice
zh_hans: 停止支持通知

source: Future versions of iTerm2 will require macOS 13 (Ventura) or later. This is the last version that supports macOS 12. Sorry for the inconvenience!
zh_hans: 未来版本的 iTerm2 将需要 macOS 13（Ventura）或更高版本。这是最后一个支持 macOS 12 的版本。给您带来不便，敬请谅解！

# ui.swift.appkit.itermmacos13requirementnotice.ok.565339bc
source: OK
zh_hans: 好

# ui.swift.appkit.itermsuppressedalertswindowcontroller.alert.44a57b22
source: Alert
zh_hans: 提醒

source: Always show alerts with remembered selections
zh_hans: 始终显示已记住选择的提醒

source: Automatic Response
zh_hans: 自动响应

# ui.swift.appkit.itermsuppressedalertswindowcontroller.done.11a6767d
source: Done
zh_hans: 完成

# ui.swift.appkit.itermsuppressedalertswindowcontroller.last_suppressed.130b02e8
source: Last Suppressed
zh_hans: 最近禁止显示

source: No alerts are currently being suppressed.
zh_hans: 当前没有被抑制的提醒。

# ui.swift.appkit.itermsuppressedalertswindowcontroller.suppressed_alerts.b90033d7
source: Suppressed Alerts
zh_hans: 已禁止显示的提醒

# ui.appkit.suppressed_alerts.explanation
source: These alerts are being answered automatically because you chose to remember your response. Select one and click Un-suppress to be asked again.
zh_hans: 由于您选择了记住响应，这些提醒会自动作答。请选择一个提醒，然后点按“取消禁止显示”，以便再次收到询问。

# ui.swift.appkit.itermsuppressedalertswindowcontroller.un_suppress.b5f0d794
source: Un-suppress
zh_hans: 取消禁止显示

# ui.swift.appkit.itermsuppressedalertswindowcontroller.un_suppress_all.401cf23c
source: Un-suppress All
zh_hans: 全部取消禁止显示

source: When you check “Remember my choice” or “Suppress this message permanently” in an alert, iTerm2 stops showing it and reuses your saved response. Turn this on to show those alerts again so you can see them or choose differently. It stays on until you turn it off.
zh_hans: 当您在提醒中勾选“记住我的选择”或“永久禁止显示此消息”时，iTerm2 将不再显示该提醒，并重复使用已保存的响应。开启此选项可再次显示这些提醒，以便查看或重新选择。此设置会一直保持开启，直到您将其关闭。

# ui.swift.appkit.profiledocument.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.swift.appkit.profiledocument.open_0.e71b4013
source: Open %1$@
zh_hans: 打开 %1$@

# ui.swift.appkit.profiledocument.profile_renamed.e38163ca
source: Profile Renamed
zh_hans: 配置文件已重命名

source: Would you like to open the profile formerly named %1$@ that is now called %2$@ (which this shortcut refers to), or the profile that currently has the name %3$@?
zh_hans: 要打开原名为 %1$@、现已名为 %2$@（此快捷方式指向它）的配置文件，还是打开当前名为 %3$@ 的配置文件？

# ui.swift.attributedstrings.attributedstringsaver.could_not_save_file.59a46d40
source: Could Not Save File
zh_hans: 无法存储文件

# ui.swift.attributedstrings.attributedstringsaver.ok.565339bc
source: OK
zh_hans: 好

source: There was a problem saving the file: %1$@
zh_hans: 存储文件时出现问题：%1$@

source: Adblock rules haven't been updated for %1$lld days
zh_hans: 广告拦截规则已 %1$lld 天未更新

source: Downloaded content is not valid JSON format
zh_hans: 下载的内容不是有效的 JSON 格式

source: Failed to parse adblock list response
zh_hans: 无法解析广告拦截列表响应

source: Invalid adblock list URL: %1$@
zh_hans: 广告拦截列表 URL 无效：%1$@

source: Are you sure you want to delete this bookmark?
zh_hans: 确定要删除此书签吗？

source: Bookmark Deleted
zh_hans: 已删除书签

source: Cancel
zh_hans: 取消

source: Delete
zh_hans: 删除

source: Delete Bookmark
zh_hans: 删除书签

source: Edit Bookmark
zh_hans: 编辑书签

source: Enter tags...
zh_hans: 输入标签…

# ui.swift.browser.bookmarks.itermbookmarktageditorwindowcontroller.save.1509f561
source: Save
zh_hans: 保存

# ui.swift.browser.bookmarks.itermbookmarktageditorwindowcontroller.tags.865658f8
source: Tags:
zh_hans: 标签：

# ui.swift.browser.bookmarks.itermbookmarktageditorwindowcontroller.title.ecd11fd9
source: Title:
zh_hans: 标题：

source: Failed to encode HTML
zh_hans: 无法编码 HTML

# ui.swift.browser.core.itermbrowsercontextmenuhelper.add_named_mark.b233ba2d
source: Add Named Mark…
zh_hans: 添加命名标记…

# ui.swift.browser.core.itermbrowsercontextmenuhelper.copy_page_title.54cecaf7
source: Copy Page Title
zh_hans: 拷贝网页标题

source: Move Browser to Split Pane
zh_hans: 将浏览器移到分割窗格

# ui.swift.browser.core.itermbrowsercontextmenuhelper.move_browser_to_tab.9760d110
source: Move Browser to Tab
zh_hans: 将浏览器移到标签页

source: Move Browser to Window
zh_hans: 将浏览器移到窗口

# ui.swift.browser.core.itermbrowsercontextmenuhelper.print.07c37125
source: Print…
zh_hans: 打印…

# ui.swift.browser.core.itermbrowsercontextmenuhelper.remove_element.75200f5d
source: Remove Element
zh_hans: 移除元素

# ui.swift.browser.core.itermbrowsercontextmenuhelper.save_page_as.1acb00a7
source: Save Page As…
zh_hans: 网页另存为…

# ui.swift.browser.core.itermbrowsercontextmenuhelper.search_with_0.bd92d41e
source: Search with %1$@
zh_hans: 使用%1$@搜索

source: Split Pane Horizontally
zh_hans: 水平分割窗格

source: Split Pane Vertically
zh_hans: 垂直分割窗格

# ui.swift.browser.core.itermbrowsercontextmenuhelper.swap_with_session.642b9b09
source: Swap With Session…
zh_hans: 与会话交换…
